<template>
  <div>
    <!-- template1 test -->
    <!-- <NewsTemplateOne 
      ref="pdfComponent"
      v-bind="newsData"
    /> -->
    <NewsTemplateTwo 
      ref="pdfComponent"
      v-bind="newsData"
    />
    
    <div class="save-button">
      <button @click="saveAsPDF">📄 PDF로 저장하기</button>
    </div>
  </div>
</template>

<script setup>
import NewsTemplateOne from '@/components/NewsTemplateOne.vue'
import NewsTemplateTwo from '@/components/NewsTemplateTwo.vue'
import html2pdf from 'html2pdf.js'
import { ref, nextTick } from 'vue' // 

const pdfComponent = ref(null)

//template1 test
// const newsData = {
//   seniorCenterName: '강일리버파크',
//   month: '07',
//   ranking: 1,
//   headline: 'AI가 생성한 헤드라인',
//   content: ' 도전 성공으로 보람된 하루를 보냈습니다.본문 내용입니다. 도전 성공으로 보람된 하루를 보냈습니다.본문 내용입니다. 도전 성공으로 보람된 하루를 보냈습니다.본문 내용입니다. 도전 성공으로 보람된 하루를 보냈습니다.본문 내용입니다. 도전 성공으로 보람된 하루를 보냈습니다.본문 내용입니다. 도전 성공으로 보람된 하루를 보냈습니다.본문 내용입니다. 도전 성공으로 보람된 하루를 보냈습니다.본문 내용입니다. 도전 성공으로 보람된 하루를 보냈습니다.본문 내용입니다. 도전 성공으로 보람된 하루를 보냈습니다.본문 내용입니다. 도전 성공으로 보람된 하루를 보냈습니다.',
//   imageUrl: 'https://picsum.photos/300'
// }

//template2 test
const newsData = {
  seniorCenterName: '강일리버파크',
  month: '07',
  ranking: 1,
  // 기사1
  headline1: 'AI가 생성한 첫 번째 도전첫 번째 도전',
  content1: '첫 번째 도전 내용입니다. 여름철 건강을 지키기 위해 백숙을 함께 즐겼습니다.첫 번째 도전 내용입니다. 여름철 건강을 지키기 위해 백숙을 함께 즐겼습니다.첫 번째 도전 내용입니다. 여름철 건강을 지키기 위해 백숙을 함께 즐겼습니다.첫 번째 도전 내용입니다. 여름철 건강을 지키기 위해 백숙을 함께 즐겼습니다.첫 번째 도전 내용입니다. 여름철 건강을 지키기 위해 백숙을 함께 즐겼습니다.첫 번째 도전 내용입니다. 여름철 건강을 지키기 위해 백숙을 함께 즐겼습니다.첫 번째 도전 내용입니다. 여름철 건강을 지키기 위해 백숙을 함께 즐겼습니다.첫 번째 도전 내용입니다.',
  imageUrl1: 'https://picsum.photos/300?random=1',
  // 기사2
  headline2: 'AI가 생성한 두 번째 도전',
  content2: '첫 번째 도전 내용입니다. 여름철 건강을 지키기 위해 백숙을 함께 즐겼습니다.첫 번째 도전 내용입니다. 여름철 건강을 지키기 위해 백숙을 함께 즐겼습니다.첫 번째 도전 내용입니다. 여름철 건강을 지키기 위해 백숙을 함께 즐겼습니다.첫 번째 도전 내용입니다. 여름철 건강을 지키기 위해 백숙을 함께 즐겼습니다.첫 번째 도전 내용입니다. 여름철 건강을 지키기 위해 백숙을 함께 즐겼습니다.첫 번째 도전 내용입니다. 여름철 건강을 지키기 위해 백숙을 함께 즐겼습니다.첫 번째 도전 내용입니다. 여름철 건강을 지키기 위해 백숙을 함께 즐겼습니다.첫 번째 도전 내용입니다.',
  imageUrl2: 'https://picsum.photos/300?random=2'
}


const saveAsPDF = async () => {
  await nextTick()
  const element = pdfComponent.value?.pdfTarget

  if (!element) {
    alert("PDF 타겟이 아직 준비되지 않았어요!")
    return
  }

  const opt = {
    margin: [5, 5, 5, 5],
    filename: `${newsData.seniorCenterName}_${newsData.month}_신문.pdf`,
    image: { type: 'jpeg', quality: 0.98 },
    html2canvas: {
      scale: 1.5,
      useCORS: true,
      allowTaint: true,
      scrollX: 0,
      scrollY: 0
    },
    jsPDF: {
      unit: 'mm',
      format: 'a4',
      orientation: 'portrait',
      compress: true
    }
  }

  html2pdf().set(opt).from(element).save()
}
</script>
